IsUserCreated Property
 Determine whether the family has been defined by the user.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2015
 Syntax
  C#
public bool IsUserCreated { get; }
  Visual Basic
Public ReadOnly Property IsUserCreated As Boolean
	Get
  Visual C++
public:
property bool IsUserCreated {
	bool get ();
}
 Remarks
 Some families are created internally and cannot be saved or reloaded. This function will return False for such internal families.
 See Also
  Family Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →